"""
物理定数の定義 (cgs単位系)
"""

# --- 物理定数 (cgs単位系) ---
h = 6.62607015e-27  # プランク定数 [erg s]
c = 2.99792458e10   # 光速度 [cm s^-1]
k_B = 1.380649e-16  # ボルツマン定数 [erg K^-1]
Lambda_ff_0 = 1.42e-27  # 制動放射冷却係数 [erg cm^3 s^-1 K^-0.5]

# 電離限界振動数
HI_nu0     = 3.288e15     # 水素の電離限界振動数 (13.6 eV) [Hz]
HeII_nu0    = 1.316e16  # He II 電離限界振動数 (54.42 eV) [Hz]
HeI_nu0    = 5.945e15   # He I 電離限界振動数 (24.59 eV) [Hz]

# 光電離断面積
HI_a0      = 6.304e-18     # 水素の光電離断面積（電離限界での値）[cm^2]
HeII_a0     = 1.58e-18
HeI_a0     = 7.42e-18

# --- ヘリウム ---
Y_He        = 0.1            # ヘリウム存在比 (n_He / n_H)